app/views/movies/show.html.erb

<h3>Comments</h3>
<% @movie.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."movie_id" = ?  [["movie_id", 1]]