app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "YEAH~"], ["updated_at", "2017-04-18 05:12:51.120612"], ["id", 7]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "information", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Big boy"], ["information", "the big boy"], ["created_at", "2017-04-13 05:17:25.611006"], ["updated_at", "2017-04-13 05:17:25.611006"]]
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save